yinshilongger/stm32_f103zet6_study/pal/stm32f10x_pal_oled.c
/**
  ******************************************************************************
  * @file    stm32f10x_pal_oled.c
  * @author  铁头山羊stm32工作组
  * @version V1.0.0
  * @date    2023年2月24日
  * @brief   oled驱动程序
  ******************************************************************************
  * @attention
  * Copyright (c) 2022 - 2023 东莞市明玉科技有限公司. 保留所有权力.
  ******************************************************************************
*/
	
#include <stdlib.h>
#include <string.h>
#include <stdio.h>
#include <stdarg.h>
#include "stm32f10x_pal_oled.h"
#include "default_font.h"
#include <math.h>

// 定义屏幕尺寸
#define OLED_SCREEN_COLS 128 
#define OLED_SCREEN_ROWS  64  
#define OLED_SCREEN_PAGES 8 

// SSD1306命令
#define SSD1306_CTRL_COMMAND           0x80  // Continuation bit=1, D/C=0; 1000 0000
#define SSD1306_CTRL_COMMAND_STREAM    0x00  // Continuation bit=0, D/C=0; 0000 0000
#define SSD1306_CTRL_DATA              0xc0  // Continuation bit=1, D/C=1; 1100 0000
#define SSD1306_CTRL_DATA_STREAM       0x40  // Continuation bit=0, D/C=1; 0100 0000

typedef struct
{
	int16_t X;
	int16_t Y;
	uint16_t Width;
	uint16_t Height;
}Rect; /* 矩形 */

static ErrorStatus OLED_SendCommand(PalOled_HandleTypeDef *Handle, const uint8_t Cmd, const uint8_t *Arg, uint16_t Size);
static ErrorStatus OLED_SendData(PalOled_HandleTypeDef *Handle, const uint8_t *pData, uint16_t Size);
static void DrawCircleFrame(PalOled_HandleTypeDef *Handle, int16_t X, int16_t Y, uint16_t Radius);
static void FillCircle(PalOled_HandleTypeDef *Handle, int16_t X, int16_t Y, uint16_t Radius);
static void DrawRectFrame(PalOled_HandleTypeDef *Handle, int16_t X, int16_t Y, uint16_t Width, uint16_t Height);
static void FillRect(PalOled_HandleTypeDef *Handle, int16_t X, int16_t Y, uint16_t Width, uint16_t Height);
static int16_t unicode_2_glyph_idx(PalOled_HandleTypeDef *Handle, uint32_t Unicode);
static void DrawCharator(PalOled_HandleTypeDef *Handle, uint32_t Unicode);
static void BrushDot(PalOled_HandleTypeDef *Handle, int16_t x, int16_t y);
static void PenDot(PalOled_HandleTypeDef *Handle, int16_t x, int16_t y);
static void DrawBitmapEx(PalOled_HandleTypeDef *Handle,int16_t X, int16_t Y, uint16_t Width, uint16_t Height, const uint8_t *pBitmap);
static uint16_t GetGlyphWidth(PalOled_HandleTypeDef *Handle, uint32_t Unicode);

// 
// @简介：OLED初始化
// @参数：Handle - OLED显示器的句柄
// @返回值：SUCCESS - 成功，ERROR - 失败
//
ErrorStatus PAL_OLED_Init(PalOled_HandleTypeDef *Handle)
{
	// 计算从机地址
	// SA0 = L -> 0x78
	// SA0 = H -> 0x7a
	if(Handle->Init.SA0 == RESET)
	{
		Handle->SlaveAddress = 0x78;
	}
	else
	{
		Handle->SlaveAddress = 0x7a;
	}
	
	// 给缓冲区A分配空间
	Handle->pBuffer = (uint8_t *)malloc(OLED_SCREEN_COLS * OLED_SCREEN_PAGES * sizeof(uint8_t));
	if(Handle->pBuffer == 0)
	{
		return ERROR;
	}
	
	memset(Handle->pBuffer, 0, OLED_SCREEN_COLS * OLED_SCREEN_PAGES * sizeof(uint8_t));
	
	uint8_t arg;
	
	CHECK(OLED_SendCommand(Handle, 0xae, 0, 0)) /* display off*/
	arg = 0x80;
	CHECK(OLED_SendCommand(Handle, 0xd5, &arg, 1)) /* clock divide ratio (0x00=1) and oscillator frequency (0x8) */
	arg = 0x3f;
	CHECK(OLED_SendCommand(Handle, 0xa8, &arg, 1)) /* multiplex ratio */
	arg = 0x00;
	CHECK(OLED_SendCommand(Handle, 0xd3, &arg, 1)) /* vertical shift */
	
	CHECK(OLED_SendCommand(Handle, 0x40, 0, 0)) /* set display start line to 0 */
	arg = 0x14;
	CHECK(OLED_SendCommand(Handle, 0x8d, &arg, 1)) /* [2] charge pump setting (p62): 0x014 enable, 0x010 disable, SSD1306 only, should be removed for SH1106 */
	arg = 0x00;
	CHECK(OLED_SendCommand(Handle, 0x20, &arg, 1)) /* horizontal addressing mode */
	
	CHECK(OLED_SendCommand(Handle, 0xa1, 0, 0)) /* segment remap a0/a1 */
	CHECK(OLED_SendCommand(Handle, 0xc8, 0, 0)) /* c0: scan dir normal, c8: reverse */
	
	arg = 0x12;
	CHECK(OLED_SendCommand(Handle, 0xda, &arg, 1)) /* com pin HW config, sequential com pin config (bit 4), disable left/right remap (bit 5) */
	arg = 0xcf;
	CHECK(OLED_SendCommand(Handle, 0x81, &arg, 1)) /* [2] set contrast control */
	arg = 0xf1;
	CHECK(OLED_SendCommand(Handle, 0xd9, &arg, 1)) /* [2] pre-charge period 0x022/f1*/
	arg = 0x20;
	CHECK(OLED_SendCommand(Handle, 0xdb, &arg, 1)) /* vcomh deselect level */
	
	// if vcomh is 0, then this will give the biggest range for contrast control issue #98
  // restored the old values for the noname constructor, because vcomh=0 will not work for all OLEDs, #116
	CHECK(OLED_SendCommand(Handle, 0x2e, 0, 0)) /* Deactivate scroll */
	CHECK(OLED_SendCommand(Handle, 0xa4, 0, 0)) /* output ram to display */
	CHECK(OLED_SendCommand(Handle, 0xa6, 0, 0)) /* none inverted normal display mode */
	
	CHECK(OLED_SendCommand(Handle, 0xaf, 0, 0)) /* display on*/
	
	Handle->PenWidth = 1; // 默认线宽1
	Handle->PenColor = PEN_COLOR_WHITE; // 默认白色画笔
	Handle->Brush = BRUSH_TRANSPARENT; // 默认白色画刷
	
	Handle->CursorX = 0;
	Handle->CursorY = 0; // 光标默认在屏幕的左上角
	
	Handle->RefreshProgress = 0;
	
	Handle->TextRegionX = 0; // 默认关闭文本框功能
	Handle->TextRegionY = 0;
	Handle->TextRegionWidth = 0;
	Handle->TextRegionHeight = 0;
	
	Handle->Font = &default_font; // 使用默认字体，8*8点阵字体
	
	return SUCCESS;
}

//
// @简介：设置剪切区域
// @参数：Handle - OLED显示器的句柄
// @参数：X - 剪切区域左上角的横坐标
// @参数：Y - 剪切区域左上角的纵坐标
// @参数：Wdith - 剪切区域宽度
// @参数：Height - 剪切区域高度
//
void PAL_OLED_StartClipRegion(PalOled_HandleTypeDef *Handle, int16_t X, int16_t Y, uint16_t Width, uint16_t Height)
{
	Handle->ClipRegionX = X;
	Handle->ClipRegionY = Y;
	Handle->ClipRegionWidth = Width;
	Handle->ClipRegionHeight = Height;
}

//
// @简介：关闭剪切区域
// @参数：Handle - OLED显示器的句柄
//
void PAL_OLED_StopClipRegion(PalOled_HandleTypeDef *Handle)
{
	Handle->ClipRegionX = 0;
	Handle->ClipRegionY = 0;
	Handle->ClipRegionWidth = 0;
	Handle->ClipRegionHeight = 0;
}

//
// @简介：获取屏幕的宽度
// @返回值：屏幕宽度，单位：像素
//
uint16_t PAL_OLED_GetScreenWidth(PalOled_HandleTypeDef *Handle)
{
	return OLED_SCREEN_COLS;
}

//
// @简介：获取屏幕高度
// @返回值：屏幕高度，单位：像素
//
uint16_t PAL_OLED_GetScreenHeight(PalOled_HandleTypeDef *Handle)
{
	return OLED_SCREEN_ROWS;
}

//
// @简介：清空缓冲区内容
// @参数：Handle - 显示器的句柄
//
void PAL_OLED_Clear(PalOled_HandleTypeDef *Handle)
{
	memset(Handle->pBuffer, 0, OLED_SCREEN_COLS * OLED_SCREEN_PAGES);
}

// 
// @简介：设置字体
// @参数：Handle - 显示器的句柄
// @参数：Font - 字体，如果要使用默认字体，可填写&default_font
//
void PAL_OLED_SetFont(PalOled_HandleTypeDef *Handle, const PalFont_TypeDef *Font)
{
	Handle->Font = Font;
}

//
// @简介：设置画笔的颜色和宽度
// @参数：Handle - 显示器的句柄
// @参数：Pen_Color - 画笔颜色
//             PEN_COLOR_TRANSPARENT - 透明
//             PEN_COLOR_WHITE - 白色
//             PEN_COLOR_BLACK - 黑色
// @参数：Width - 画笔宽度
// 
void PAL_OLED_SetPen(PalOled_HandleTypeDef *Handle, uint8_t Pen_Color, uint8_t Width)
{
	Handle->PenColor = Pen_Color;
	Handle->PenWidth = Width;
}

//
// @简介：设置画刷
// @参数：Handle - 显示器的句柄
// @参数：Brush_Color - 画刷颜色
//             BRUSH_TRANSPARENT - 透明
//             BRUSH_WHITE - 白色
//             BRUSH_BLACK - 黑色
// 
void PAL_OLED_SetBrush(PalOled_HandleTypeDef *Handle, uint8_t Brush_Color)
{
	Handle->Brush = Brush_Color;
}

//
// @简介：将光标设置到坐标点（X，Y）处
// @参数：Handle - 显示器的句柄
// @参数：X - 光标横坐标
// @参数：Y - 光标纵坐标
// 
void PAL_OLED_SetCursor(PalOled_HandleTypeDef *Handle, int16_t X, int16_t Y)
{
	Handle->CursorX = X;
	Handle->CursorY = Y;
}

//
// @简介：将光标的横坐标设置到X处
// @参数：Handle - 显示器的句柄
// @参数：X - 光标横坐标
// 
void PAL_OLED_SetCursorX(PalOled_HandleTypeDef *Handle, int16_t X)
{
	Handle->CursorX = X;
}

//
// @简介：将光标的纵坐标设置到Y处
// @参数：Handle - 显示器的句柄
// @参数：Y - 光标纵坐标
// 
void PAL_OLED_SetCursorY(PalOled_HandleTypeDef *Handle, int16_t Y)
{
	Handle->CursorY = Y;
}

//
// @简介：移动光标
// @参数：Handle - 显示器的句柄
// @参数：dX - 横向移动的距离
// @参数：dY - 纵向移动的距离
// 
void PAL_OLED_MoveCursor(PalOled_HandleTypeDef *Handle, int16_t dX, int16_t dY)
{
	Handle->CursorX += dX;
	Handle->CursorY += dY;
}

//
// @简介：横向移动光标
// @参数：Handle - 显示器的句柄
// @参数：dX - 横向移动的距离
// 
void PAL_OLED_MoveCursorX(PalOled_HandleTypeDef *Handle, int16_t dX)
{
	Handle->CursorX += dX;
}

//
// @简介：纵向移动光标
// @参数：Handle - 显示器的句柄
// @参数：dY - 纵向移动的距离
// 
void PAL_OLED_MoveCursorY(PalOled_HandleTypeDef *Handle, int16_t dY)
{
	Handle->CursorY += dY;
}

//
// 简介：获取光标的当前位置
// @参数：Handle - 显示器的句柄
// @参数：pXOut - 输出参数，用于接收光标的横坐标
// @参数：pYOut - 输出参数，用于接收光标的纵坐标
// 
void PAL_OLED_GetCursor(PalOled_HandleTypeDef *Handle, int16_t *pXOut, int16_t *pYOut)
{
	*pXOut = Handle->CursorX;
	*pYOut = Handle->CursorY;
}

//
// 简介：获取光标的横坐标
// @参数：Handle - 显示器的句柄
// @返回值：光标的横坐标值
// 
int16_t PAL_OLED_GetCursorX(PalOled_HandleTypeDef *Handle)
{
	return Handle->CursorX;
}

//
// 简介：获取光标的纵坐标
// @参数：Handle - 显示器的句柄
// @返回值：光标的纵坐标值
// 
int16_t PAL_OLED_GetCursorY(PalOled_HandleTypeDef *Handle)
{
	return Handle->CursorY;
}

#define min(x1,x2) x1>x2?x2:x1
#define max(x1,x2) x1>x2?x1:x2

