yinshilongger/stm32_f103zet6_study/pal/stm32f10x_pal_oled.c
static Rect GetOverlappedRect(Rect rect1, Rect rect2)
{
	Rect ret = {0,0,0,0};
	
	int16_t xl = max(rect1.X,rect2.X);
	int16_t xr = min(rect1.X + rect1.Width, rect2.X + rect2.Width);
	
	int16_t yt = max(rect1.Y,rect2.Y);
	int16_t yb = min(rect1.Y + rect1.Height, rect2.Y + rect2.Height);
	
	if(xl<xr&&yt<yb)
	{
		ret.X = xl;
		ret.Y = yt;
		ret.Width = xr - xl;
		ret.Height = yb - yt;
	}
	
	return ret;
}

static uint16_t GetGlyphWidth(PalOled_HandleTypeDef *Handle, uint32_t Unicode)
{
	if(Handle->Font == NULL) return 0; // 未设置字体
	
	int16_t idx = unicode_2_glyph_idx(Handle, Unicode);
	
	if(idx < 0) return 0; // 未找到对应的字形
	
	return Handle->Font->Glyphs[idx].Dwx0;
}

static void DrawCharator(PalOled_HandleTypeDef *Handle, uint32_t Unicode)
{
	if(Handle->Font == NULL) return; // 未设置字体
	
	int16_t idx = unicode_2_glyph_idx(Handle, Unicode);
	
	const PalGlyph_TypeDef *pGlyph = 0;
	
	if(idx >=0)
	{
		pGlyph = &Handle->Font->Glyphs[idx];
	}
	
	int16_t clipRegionXCpy, clipRegionYCpy, clipRegionWidthCpy, clipRegionHeightCpy;
	
	// 如果启用了文本框区域
	if(Handle->TextRegionWidth!=0 && Handle->TextRegionHeight!=0)
	{
		// 备份剪切区域
		clipRegionXCpy = Handle->ClipRegionX;
		clipRegionYCpy = Handle->ClipRegionY;
		clipRegionWidthCpy = Handle->ClipRegionWidth;
		clipRegionHeightCpy = Handle->ClipRegionHeight;
		
		// 将剪切区域设置到与文本框区域相交处
		
		if(Handle->ClipRegionWidth != 0 && Handle->ClipRegionHeight != 0)
		{
			Rect rect1 = {Handle->TextRegionX, Handle->TextRegionY, Handle->TextRegionWidth, Handle->TextRegionHeight};
			Rect rect2 = {Handle->ClipRegionX, Handle->ClipRegionY, Handle->ClipRegionWidth, Handle->ClipRegionHeight};
			Rect overlapped = GetOverlappedRect(rect1, rect2);
			
			Handle->ClipRegionX = overlapped.X;
			Handle->ClipRegionY = overlapped.Y;
			Handle->ClipRegionWidth = overlapped.Width;
			Handle->ClipRegionHeight = overlapped.Height;
		}
		else
		{
			Handle->ClipRegionX = Handle->TextRegionX;
			Handle->ClipRegionY = Handle->TextRegionY;
			Handle->ClipRegionWidth = Handle->TextRegionWidth;
			Handle->ClipRegionHeight = Handle->TextRegionHeight;
		}
		
		// 如果光标在文本框之外
		if(Handle->CursorX<Handle->TextRegionX || Handle->CursorX>=Handle->TextRegionX+Handle->TextRegionWidth)
		{
			Handle->CursorX = Handle->TextRegionX; // 让光标回到起始点
		}
		
		if(pGlyph != 0)
		{
			// 如果下一个字符的宽度超过了文本框
			if(Handle->CursorX+pGlyph->Dwx0 >= Handle->TextRegionX+Handle->TextRegionWidth)
			{
				Handle->CursorX = Handle->TextRegionX; // 让光标回到起始点
				Handle->CursorY = Handle->CursorY + Handle->Font->FBBy + Handle->Font->FBBYoff;
			}
		}
		
		// 如果为\r（回车）
		if(Unicode == '\r')
		{
			Handle->CursorX = Handle->TextRegionX;
		}
		else if(Unicode == '\n')
		{
			Handle->CursorY = Handle->CursorY + Handle->Font->FBBy + Handle->Font->FBBYoff;
		}
	}
	
	if(pGlyph != 0)
	{
		// 绘制背景
		FillRect(Handle, Handle->CursorX, Handle->CursorY - Handle->Font->FBBYoff - Handle->Font->FBBy, pGlyph->Dwx0, Handle->Font->FBBy);
		
		// 绘制字形
		DrawBitmapEx(Handle, Handle->CursorX + pGlyph->BBxoff0x, Handle->CursorY - pGlyph->BByoff0y - pGlyph->BBh, pGlyph->BBw, pGlyph->BBh, pGlyph->Bitmap);
	}
	
	// 如果启用了文本框区域
	if(Handle->TextRegionWidth!=0 && Handle->TextRegionHeight!=0)
	{
		// 恢复剪切区域
		Handle->ClipRegionX = clipRegionXCpy;
		Handle->ClipRegionY = clipRegionYCpy;
		Handle->ClipRegionWidth = clipRegionWidthCpy;
		Handle->ClipRegionHeight = clipRegionHeightCpy;
	}
	if(pGlyph != 0){
		Handle->CursorX += pGlyph->Dwx0;
	}
}

//
// 简介：从光标处开始绘制字符串
// @参数：Handle - 显示器的句柄
// @参数：Str - 要绘制的字符串
// 
void PAL_OLED_DrawString(PalOled_HandleTypeDef *Handle, const char *Str)
{
	// 注意这里使用的是UTF-8编码，因此先将其解析成Unicode
	uint16_t i;
	uint32_t unicode;
	uint8_t first, second, third, forth;
	
	i=0;
	for(;;)
	{
		first = Str[i++];
		if(first == '\0') break; 
		
		if ((first & (1 << 7)) == 0) // 1字节
		{
			unicode = first;
			DrawCharator(Handle, unicode);
		}
		else if ((first & (1 << 7 | 1 << 6 | 1 << 5)) == (1 << 7 | 1 << 6)) // 2字
		{
			first = first & 0x1f;
			
			second = Str[i++];
			if(second == '\0' || ((second & (1 << 7 | 1 << 6)) != 0x80)) break;
			second = second & 0x3f;
			
			unicode = ((uint32_t)first << 6) | second;
			DrawCharator(Handle, unicode);
		}
		else if ((first & (1 << 7 | 1 << 6 | 1 << 5 | 1 << 4)) == (1 << 7 | 1 << 6 | 1 << 5)) // 3字节
		{
			first = first & 0x0f;
			
			second = Str[i++];
			if(second == '\0' || ((second & (1 << 7 | 1 << 6)) != 0x80)) break;
			second = second & 0x3f;
			
			third = Str[i++];
			if(third == '\0' || ((third & (1 << 7 | 1 << 6)) != 0x80)) break;
			third = third & 0x3f;
			
			unicode = ((uint32_t)first << 12) | ((uint32_t)second << 6) | third;
			DrawCharator(Handle, unicode);
		}
		else if ((first & (1 << 7 | 1 << 6 | 1 << 5 | 1 << 4 | 1 << 3)) == (1 << 7 | 1 << 6 | 1 << 5 | 1 << 4)) // 4字节
		{
			first = first & 0x07;
			
			second = Str[i++];
			if(second == '\0' || ((second & (1 << 7 | 1 << 6)) != 0x80)) break;
			second = second & 0x3f;
			
			third = Str[i++];
			if(third == '\0' || ((third & (1 << 7 | 1 << 6)) != 0x80)) break;
			third = third & 0x3f;
			
			forth = Str[i++];
			if(forth == '\0' || ((forth & (1 << 7 | 1 << 6)) != 0x80)) break;
			forth = forth & 0x3f;
			
			unicode = ((uint32_t)first << 18) | ((uint32_t)second << 12) | ((uint32_t)second << 6) | forth;
			
			DrawCharator(Handle, unicode);
		}
	}
}


//
// @简介：设置文本框区域，同时将光标移动到文本框的第一个字符处
// @参数：Handle - 显示器的句柄
// @参数：X - 文本框左上角的横坐标
// @参数：Y - 文本框左上角的纵坐标
// @参数：Width - 文本框的宽度
// @参数：Height - 文本框的高度
//
void PAL_OLED_StartTextRegion(PalOled_HandleTypeDef *Handle, int16_t X, int16_t Y, uint16_t Width, uint16_t Height)
{
	Handle->TextRegionX = X;
	Handle->TextRegionY = Y;
	Handle->TextRegionWidth = Width;
	Handle->TextRegionHeight = Height;
	
	Handle->CursorX = X;
	Handle->CursorY = Y + PAL_OLED_GetFontHeight(Handle);
}

//
// @简介：取消文本框
// @参数：Handle - 显示器的句柄
//
void PAL_OLED_StopTextRegion(PalOled_HandleTypeDef *Handle)
{
	Handle->TextRegionX = 0;
	Handle->TextRegionY = 0;
	Handle->TextRegionWidth = 0;
	Handle->TextRegionHeight = 0;
}

//
// 简介：绘制格式化字符串
// @参数：Handle - 显示器的句柄
// @参数：Format - 格式
// @参数：... - 可变参数
// 
void PAL_OLED_Printf(PalOled_HandleTypeDef *Handle, const char *Format, ...)
{
	char format_buffer[128];
	
