yinshilongger/stm32_f103zet6_study/pal/stm32f10x_pal_oled.c
	va_list argptr;
	__va_start(argptr, Format);
	vsprintf(format_buffer, Format, argptr);
	__va_end(argptr);
	PAL_OLED_DrawString(Handle, format_buffer);
}

//
// @简介：获取当前字体下字符串所占的宽度
// @参数：Handle - 显示器的句柄
// @参数：Str    - 字符串
// @返回值：宽度，单位：像素
// 
uint16_t PAL_OLED_GetStrWidth(PalOled_HandleTypeDef *Handle, const char *Str)
{
		// 注意这里使用的是UTF-8编码，因此先将其解析成Unicode
	uint16_t i;
	uint32_t unicode;
	uint8_t first, second, third, forth;
	uint16_t ret = 0;
	
	i=0;
	for(;;)
	{
		first = Str[i++];
		if(first == '\0') break; 
		
		if ((first & (1 << 7)) == 0) // 1字节
		{
			unicode = first;
			ret += GetGlyphWidth(Handle, unicode);
		}
		else if ((first & (1 << 7 | 1 << 6 | 1 << 5)) == (1 << 7 | 1 << 6)) // 2字
		{
			first = first & 0x1f;
			
			second = Str[i++];
			if(second == '\0' || ((second & (1 << 7 | 1 << 6)) != 0x80)) break;
			second = second & 0x3f;
			
			unicode = ((uint32_t)first << 6) | second;
			ret += GetGlyphWidth(Handle, unicode);
		}
		else if ((first & (1 << 7 | 1 << 6 | 1 << 5 | 1 << 4)) == (1 << 7 | 1 << 6 | 1 << 5)) // 3字节
		{
			first = first & 0x0f;
			
			second = Str[i++];
			if(second == '\0' || ((second & (1 << 7 | 1 << 6)) != 0x80)) break;
			second = second & 0x3f;
			
			third = Str[i++];
			if(third == '\0' || ((third & (1 << 7 | 1 << 6)) != 0x80)) break;
			third = third & 0x3f;
			
			unicode = ((uint32_t)first << 12) | ((uint32_t)second << 6) | third;
			ret += GetGlyphWidth(Handle, unicode);
		}
		else if ((first & (1 << 7 | 1 << 6 | 1 << 5 | 1 << 4 | 1 << 3)) == (1 << 7 | 1 << 6 | 1 << 5 | 1 << 4)) // 4字节
		{
			first = first & 0x07;
			
			second = Str[i++];
			if(second == '\0' || ((second & (1 << 7 | 1 << 6)) != 0x80)) break;
			second = second & 0x3f;
			
			third = Str[i++];
			if(third == '\0' || ((third & (1 << 7 | 1 << 6)) != 0x80)) break;
			third = third & 0x3f;
			
			forth = Str[i++];
			if(forth == '\0' || ((forth & (1 << 7 | 1 << 6)) != 0x80)) break;
			forth = forth & 0x3f;
			
			unicode = ((uint32_t)first << 18) | ((uint32_t)second << 12) | ((uint32_t)second << 6) | forth;
			
			ret += GetGlyphWidth(Handle, unicode);
		}
	}
	
	return ret;
}

// 
// @简介：获取当前字体的最大高度
// @参数：Handle - 显示器的句柄
// @返回值：字体最大高度
// 
uint16_t PAL_OLED_GetFontHeight(PalOled_HandleTypeDef *Handle)
{
	return Handle->Font->FontSize;
}

#define swap(x,y) do{(x) = (x) + (y); (y) = (x) - (y); (x) = (x) - (y); }while(0)

//
// @简介：画点
// @参数：Handle - OLED显示器的句柄	
// @参数：X - 横坐标
// @参数：Y - 纵坐标
//
void PAL_OLED_DrawDot(PalOled_HandleTypeDef *Handle)
{
	PenDot(Handle, Handle->CursorX, Handle->CursorY);
}	

//
// @简介：以当前光标位置为起点绘制直线
// @参数：Handle - OLED显示器的句柄	
// @参数：X - 终止点横坐标
// @参数：Y - 终止点纵坐标
// 
void PAL_OLED_DrawLine(PalOled_HandleTypeDef *Handle, int16_t X, int16_t Y)
{
	int16_t x, y;
	int16_t X0 = Handle->CursorX;
	int16_t Y0 = Handle->CursorY;
	int16_t X1 = X;
	int16_t Y1 = Y;
	
	if(Handle->PenColor == PEN_COLOR_TRANSPARENT) return; // 透明画笔不需要绘图
	
	if(X0 != X1)
	{
		if(X0 > X1)
		{
			swap(X0, X1);
			swap(Y0, Y1);
		}
		for(x=X0; x < X1; x++)
		{
			if(x < 0 || x >= OLED_SCREEN_COLS) continue;
			y = (int16_t)round(1.0 * (Y1 - Y0) * (x - X0) / (X1 - X0) + Y0);
			if(y < 0 || y >= OLED_SCREEN_ROWS) continue;
			
			PenDot(Handle, x, y);
		}
	}
	if(Y0 != Y1)
	{
		if(Y0 > Y1)
		{
			swap(X0, X1);
			swap(Y0, Y1);
		}
		for(y=Y0; y < Y1; y++)
		{
			if(y < 0 || y >= OLED_SCREEN_ROWS) continue;
			x = (int16_t)round(1.0 * (y - Y0) * (X1 - X0) / (Y1 - Y0) + X0);
			if(x < 0 || x >= OLED_SCREEN_COLS) continue;
			
			PenDot(Handle, x, y);
		}
	}
}

//
// @简介：以当前光标位置为起点绘制直线，绘制完成后光标移动到线段的终点
// @参数：Handle - OLED显示器的句柄	
// @参数：X - 终止点横坐标
// @参数：Y - 终止点纵坐标
// 
void PAL_OLED_LineTo(PalOled_HandleTypeDef *Handle, int16_t X, int16_t Y)
{
	PAL_OLED_DrawLine(Handle, X, Y);
	Handle->CursorX = X;
	Handle->CursorY = Y;
}

static void DrawCircleFrame(PalOled_HandleTypeDef *Handle, int16_t X, int16_t Y, uint16_t Radius)
{
	int16_t x, y, distance;
	
	if(Handle->PenColor == PEN_COLOR_TRANSPARENT) return; // 透明画笔不需要绘图

	if(X - Radius >= OLED_SCREEN_COLS || X + Radius < 0) return; // 绘图区域超出缓冲区范围
	if(Y - Radius >= OLED_SCREEN_ROWS || Y + Radius < 0) return; // 绘图区域超出缓冲区范围

	for(x=X-Radius; x<=X+Radius; x++)
	{
		if(x < 0 || x > OLED_SCREEN_COLS) continue; // x坐标超出缓冲区范围
		for(distance = 0; distance <= Radius; distance++)
		{
			if((x - X) * (x - X) + (distance + 1) * (distance + 1) > Radius * Radius) // x^2 + y ^ 2 > radius^2
			{
				if(Y+distance < OLED_SCREEN_ROWS && x >= 0 && x < OLED_SCREEN_COLS)
				{
					PenDot(Handle, x, Y+distance);
				}
				if(Y-distance > 0 && x >= 0 && x < OLED_SCREEN_COLS)
				{
					PenDot(Handle, x, Y-distance);
				}
				break;
			}
		}
	}

	for(y=Y-Radius; y<=Y+Radius; y++)
	{
		if(y < 0 || y > OLED_SCREEN_ROWS) continue;
		for(distance = 0; distance <= Radius; distance++)
		{
			if((y - Y) * (y - Y) + (distance + 1) * (distance + 1) > Radius * Radius)
			{
				if(X+distance < OLED_SCREEN_COLS && y >=0 && y < OLED_SCREEN_ROWS)
				{
					PenDot(Handle, X+distance, y);
				}
				if(X-distance > 0 && y >=0 && y < OLED_SCREEN_ROWS)
				{
					PenDot(Handle, X-distance, y);
				}
				break;
			}
		}
	}
}

static void FillCircle(PalOled_HandleTypeDef *Handle, int16_t X, int16_t Y, uint16_t Radius)
{
	int16_t x, distance;
	
	if(Handle->Brush == BRUSH_TRANSPARENT) return; // 透明画刷不需要绘图

	if(X - Radius >= OLED_SCREEN_COLS || X + Radius < 0) return;
	if(Y - Radius >= OLED_SCREEN_ROWS || Y + Radius < 0) return;

	for(x=X-Radius; x<=X+Radius; x++)
	{
		if(x < 0 || x > OLED_SCREEN_COLS) continue;
		for(distance = 0; distance <= Radius; distance++)
		{
			if((x - X) * (x - X) + distance*distance <= Radius * Radius)
			{
				if(Y+distance < OLED_SCREEN_ROWS)
				{
					BrushDot(Handle, x, Y+distance);
				}
				if(Y-distance > 0)
				{
					BrushDot(Handle, x, Y-distance);
				}
			}
			else
			{
				break;
			}
		}
	}
}

//
// @简介：以光标为圆心绘制圆形
// @参数：Handle - OLED显示器的句柄	
// @参数：X - 圆心横坐标
// @参数：Y - 圆心纵坐标
// @参数：Radius - 圆的半径
// 
void PAL_OLED_DrawCircle(PalOled_HandleTypeDef *Handle, uint16_t Radius)
{
	int16_t X = Handle->CursorX, Y = Handle->CursorY;
	
	if(Handle->PenColor != PEN_COLOR_TRANSPARENT)
	{
		DrawCircleFrame(Handle, X, Y, Radius);
	}
	
	if(Handle->Brush != BRUSH_TRANSPARENT)
	{
		FillCircle(Handle, X, Y, Radius);
	}
}

