yinshilongger/stm32_f103zet6_study/pal/stm32f10x_pal_oled.c
static void DrawRectFrame(PalOled_HandleTypeDef *Handle, int16_t X, int16_t Y, uint16_t Width, uint16_t Height)
{
	int16_t x,y;
	
	if(Handle->PenColor == PEN_COLOR_TRANSPARENT) return; // 透明画笔不需要绘图
	
	// 绘制左侧边
	x = X;
	if(x>=0 && x<OLED_SCREEN_COLS)
	{
		for(y=max(0,Y);y<Y+Height;y++)
		{
			PenDot(Handle, x, y);
		}
	}
	
	// 绘制右侧边
	x = X + Width -1;
	if(Width > 0 && x>=0 && x<OLED_SCREEN_COLS)
	{
		for(y=max(0,Y);y<Y+Height;y++)
		{
			PenDot(Handle, x, y);
		}
	}
	
	// 绘制上边
	y = Y;
	if(y>=0 && y<OLED_SCREEN_ROWS)
	{
		for(x=max(0,X);x<X+Width;x++)
		{
			PenDot(Handle, x, y);
		}
	}
	
	// 绘制下边
	y = Y + Height - 1;
	if(y>=0 && y<OLED_SCREEN_ROWS)
	{
		for(x=max(0,X);x<X+Width;x++)
		{
			PenDot(Handle, x, y);
		}
	}
}

static void FillRect(PalOled_HandleTypeDef *Handle, int16_t X, int16_t Y, uint16_t Width, uint16_t Height)
{
	if(Handle->Brush == BRUSH_TRANSPARENT) return; // 透明画刷不需要绘图
	
	int16_t x,y;
	
	for(x=X;x<X+Width;x++)
	{
		for(y=Y;y<Y+Height;y++)
		{
			BrushDot(Handle, x, y);
		}
	}
}

//
// @简介：以光标位置为左上角绘制矩形
// @参数：Handle - OLED显示器的句柄
// @参数：X - 矩形左上角的横坐标
// @参数：Y - 矩形左上角的纵坐标
// @参数：Width - 矩形宽度
// @参数：Height - 矩形高度
// 
void PAL_OLED_DrawRect(PalOled_HandleTypeDef *Handle, uint16_t Width, uint16_t Height)
{
	if(Handle->PenColor != PEN_COLOR_TRANSPARENT)
	{
		DrawRectFrame(Handle, Handle->CursorX, Handle->CursorY, Width, Height);
	}
	if(Handle->Brush != BRUSH_TRANSPARENT)
	{
		FillRect(Handle, Handle->CursorX, Handle->CursorY, Width, Height);
	}
}

//
// @简介：开始分段发送缓冲区内容到屏幕（每个8*8的区域为一个单元进行发送）
// @参数：Handle - OLED显示器的句柄
// @返回值：SUCCESS - 启动成功，ERROR - 启动失败
//
ErrorStatus PAL_OLED_StartSendBuffer(PalOled_HandleTypeDef *Handle)
{
	uint8_t arg[2];
	
	Handle->RefreshProgress = 0;
	
	// 设置寻址模式为横向寻址模式
	arg[0] = 0x00;
	CHECK(OLED_SendCommand(Handle, 0x20, arg, 1))

	// 设置列范围
	arg[0] = 0x00;
	arg[1] = 0x7f;
	CHECK(OLED_SendCommand(Handle, 0x21, arg, 2));

	// 设置页范围
	arg[0] = 0x00;
	arg[1] = 0x07;
	CHECK(OLED_SendCommand(Handle, 0x22, arg, 2));
	
	return SUCCESS;
}

//
// @简介：分段发送缓冲区内容到屏幕（每个8*8的区域为一个单元进行发送）
// @参数：Handle - OLED显示器的句柄
// @参数：pMoreOut - 输出参数，用于接收是否有后续数据需要发送
//                   0    - 当前分段为最后一个分段，至此所有分段均已发送结束
//                   非零 - 当前分段不是最后一个分段
// @返回值：SUCCESS - 成功，ERROR - 失败
//
ErrorStatus PAL_OLED_EndSendBuffer(PalOled_HandleTypeDef *Handle, uint8_t *pMoreOut)
{
	if(Handle->RefreshProgress >= 127)
	{
		*pMoreOut = 0;
	}
	else
	{
		*pMoreOut = 1;
	}
	
	if(Handle->RefreshProgress >= 128)
	{
		return ERROR;
	}
	
	// 更新显示数据
	CHECK(OLED_SendData(Handle, &Handle->pBuffer[Handle->RefreshProgress * 8], 8));
	
	Handle->RefreshProgress = (Handle->RefreshProgress + 1) % 128;
	
	return SUCCESS;
}

//
// @简介：将缓冲区数据一次性发送到屏幕
// @参数：Handle - OLED显示器的句柄
// @返回值：SUCCESS - 成功，ERROR - 失败
//
ErrorStatus PAL_OLED_SendBuffer(PalOled_HandleTypeDef *Handle)
{
	uint8_t arg[2];

	// 设置寻址模式为横向寻址模式
	arg[0] = 0x00;
	CHECK(OLED_SendCommand(Handle, 0x20, arg, 1))

	// 设置列范围
	arg[0] = 0x00;
	arg[1] = 0x7f;
	CHECK(OLED_SendCommand(Handle, 0x21, arg, 2));

	// 设置页范围
	arg[0] = 0x00;
	arg[1] = 0x07;
	CHECK(OLED_SendCommand(Handle, 0x22, arg, 2));
	
	// 更新显示数据
	CHECK(OLED_SendData(Handle, Handle->pBuffer, OLED_SCREEN_COLS * OLED_SCREEN_PAGES));
	
	return SUCCESS;
}

static ErrorStatus OLED_SendCommand(PalOled_HandleTypeDef *Handle, uint8_t Cmd, const uint8_t *Arg, uint16_t Size)
{
	uint8_t buf[8];
	uint8_t i;
	
	buf[0] = SSD1306_CTRL_COMMAND_STREAM;
	buf[1] = Cmd;
	
	for(i=0;i<Size;i++)
	{
		buf[i + 2] =  Arg[i];
	}
	
	CHECK(PAL_I2C_MasterTransmit(Handle->Init.hi2c, Handle->SlaveAddress, buf, i+2))
	
	return SUCCESS;
}

static ErrorStatus OLED_SendData(PalOled_HandleTypeDef *Handle, const uint8_t *pData, uint16_t Size)
{
	
	ErrorStatus ret = SUCCESS;
	
	if(PAL_I2C_StartTx(Handle->Init.hi2c, Handle->SlaveAddress) != SUCCESS)
	{
		ret = ERROR;
		goto TAG_SEND_STOP;
	}
	
	if(PAL_I2C_SendByte(Handle->Init.hi2c, SSD1306_CTRL_DATA_STREAM) != SUCCESS)
	{
		ret = ERROR;
		goto TAG_SEND_STOP;
	}
	
	if(PAL_I2C_SendBytes(Handle->Init.hi2c, pData, Size) != SUCCESS)
	{
		ret = ERROR;
		goto TAG_SEND_STOP;
	}
	
TAG_SEND_STOP:
	
	PAL_I2C_StopTx(Handle->Init.hi2c);
	
	return ret;
}

//
// @简介：绘制位图
// @参数：Handle - OLED显示器的句柄
// @参数：X - 位图左上角的横坐标
// @参数：Y - 位图左上角的纵坐标
// @参数：Width - 位图宽度
// @参数：Height - 位图高度
// @参数：pBitmap - 位图数据
//
static void DrawBitmapEx(PalOled_HandleTypeDef *Handle,int16_t X, int16_t Y, uint16_t Width, uint16_t Height, const uint8_t *pBitmap)
{
	int16_t x,y;
	
	if(Handle->Brush == BRUSH_TRANSPARENT && Handle->PenColor == PEN_COLOR_TRANSPARENT) return; // 透明画刷不做任何操作
	
	uint16_t penWidthCpy = Handle->PenWidth;
	
	Handle->PenWidth = 1;
	
	uint16_t nBytesPerRow = (uint16_t)ceil(Width / 8.0);
	
	for(x=0;x<Width;x++)
	{
		for(y=0;y<Height;y++)
		{
			// b0 b1 .. b7 b0 b1 
			if((pBitmap[x/8+y*nBytesPerRow] & (0x80>>(x%8))) != 0)
			{
				PenDot(Handle, X+x, Y+y);
			}
			else
			{
				BrushDot(Handle, X+x, Y+y);
			}
		}
	}
	
	Handle->PenWidth = penWidthCpy;
}

//
// @简介：以光标位置为左上角绘制位图
// @参数：X - 位图左上角横坐标
// @参数：Y - 位图左上角纵坐标
// @参数：Width - 位图宽度
// @参数：Height - 位图高度
// @参数：pBitmap - 位图数据，格式：每个字节表示横向的8个像素点，行末尾不足8个像素的用0补齐
//
void PAL_OLED_DrawBitmap(PalOled_HandleTypeDef *Handle, uint16_t Width, uint16_t Height, const uint8_t *pBitmap)
{
	DrawBitmapEx(Handle, Handle->CursorX, Handle->CursorY, Width, Height, pBitmap);
}

// 
// @简介：根据字符的unicode码获取字形序号
// @参数：Handle - OLED显示器句柄
// @参数：Unicode - 字符的Unicode编码
// @返回值：如果查找成功则返回字符序号，否则返回-1
//
static int16_t unicode_2_glyph_idx(PalOled_HandleTypeDef *Handle, uint32_t Unicode)
{
	int16_t ret = -1;
	
	if(Handle->Font == 0)
	{
		return -1;
	}
	
	uint32_t i;
	
	for(i = 0; i < Handle->Font->nChars; i++)
	{
		if(Handle->Font->Map[i] == Unicode)
		{
			ret = i;
			break;
		}
	}
	
	return ret;
}

static void PenDot(PalOled_HandleTypeDef *Handle, int16_t x, int16_t y)
{
	// 判断是否是透明画笔
	if(Handle->PenColor == PEN_COLOR_TRANSPARENT)
	{
		return; // 透明画笔不需要绘图
	}
	
	if(Handle->PenWidth == 0)
	{
		return;
	}
	
	uint16_t borderLeft, borderRight, borderTop, borderBottom;
	
	if(Handle->PenWidth % 2)
	{
		borderLeft = borderRight = borderTop = borderBottom = Handle->PenWidth / 2;
	}
	else
	{
		borderLeft = borderRight = borderTop = borderBottom = Handle->PenWidth / 2;
		borderLeft--;
		borderTop--;
	}
	
	// 绘图
	// 备份画刷
	uint8_t brushCpy = Handle->Brush;
	
	Handle->Brush = Handle->PenColor;
	
	int16_t i,j;
	
	for(i=x-borderLeft;i<=x+borderRight;i++)
	{
		for(j=y-borderTop;j<=y+borderBottom;j++)
		{
			BrushDot(Handle, i, j);
		}
	}
	
	// 还原画刷
	Handle->Brush = brushCpy;
}

static void BrushDot(PalOled_HandleTypeDef *Handle, int16_t x, int16_t y)
{
	// 判断是否是透明画笔
	if(Handle->Brush == BRUSH_TRANSPARENT)
	{
		return; // 透明画笔不需要绘图
	}
	
	// 判断绘图点是否在屏幕外部
	if(x < 0 || x >= OLED_SCREEN_COLS)
	{
		return;
	}
	
	if(y<0 || y >= OLED_SCREEN_ROWS)
	{
		return;
	}
	
	// 判断是否在绘图区域的外部
	if(Handle->ClipRegionWidth != 0 && Handle->ClipRegionHeight != 0)
	{
		if(x<Handle->ClipRegionX || x>=Handle->ClipRegionX + Handle->ClipRegionWidth)
		{
			return;
		}
		if(y<Handle->ClipRegionY || y>=Handle->ClipRegionY + Handle->ClipRegionHeight)
		{
			return;
		}
	}
	
	// 绘图
	if(Handle->Brush == BRUSH_WHITE) // 点亮
	{
		Handle->pBuffer[x + y / 8 * OLED_SCREEN_COLS] |= 1 << (y % 8);
	}
	else // 熄灭
	{
		Handle->pBuffer[x + y / 8 * OLED_SCREEN_COLS] &= ~(1 << (y % 8));
	}
}
